[ShadowOps_CombatEngineer_LWOTC X2SoldierClassTemplate]
DisplayName="Combat Engineer"
ClassSummary="Combat Engineers are experts at using grenades both offensively and defensively. If you want something blown up, torn down, or hidden in smoke, bring a Combat Engineer."
LeftAbilityTreeTitle="Pioneer"
RightAbilityTreeTitle="Sapper"
+AbilityTreeTitles[0]="Pioneer"
+AbilityTreeTitles[1]="Protector"
+AbilityTreeTitles[2]="Sapper"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNickNames[0]="Amp It Up"
RandomNickNames[1]="Bolt"
RandomNickNames[2]="Boomer"
RandomNickNames[3]="Bubblegum"
RandomNickNames[4]="Cable"
RandomNickNames[5]="Charcoal"
RandomNickNames[6]="Cooked Meat"
RandomNickNames[7]="Dr. Boom"
RandomNickNames[8]="Drive"
RandomNickNames[9]="Gears"
RandomNickNames[10]="Goggles"
RandomNickNames[11]="Grip"
RandomNickNames[12]="Gyro"
RandomNickNames[13]="High Voltage"
RandomNickNames[14]="Jigsaw"
RandomNickNames[15]="Murphy"
RandomNickNames[16]="No Hands"
RandomNickNames[17]="Powder"
RandomNickNames[18]="Pump"
RandomNickNames[19]="Ratchet"
RandomNickNames[20]="Smoke"
RandomNickNames[21]="System"
RandomNickNames[22]="Thunder"
RandomNickNames[23]="Torque"
RandomNickNames[24]="Wrench"

[ShadowOps_Dragoon_LWOTC X2SoldierClassTemplate]
DisplayName="Dragoon"
ClassSummary="The Dragoon is a versatile class that can bring heavy weapons and armor to the front lines, or run fast and light for infiltration missions. They excel at protecting and supporting the rest of the squad."
LeftAbilityTreeTitle="Paladin"
RightAbilityTreeTitle="Ghost"
+AbilityTreeTitles[0]="Paladin"
+AbilityTreeTitles[1]="Reinforcer"
+AbilityTreeTitles[2]="Ghost"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNickNames[0]="Breaker"
RandomNickNames[1]="Circuit"
RandomNickNames[2]="Core Dump"
RandomNickNames[3]="Cyber"
RandomNickNames[4]="Cyborg"
RandomNickNames[5]="Griffon"
RandomNickNames[6]="Hammer"
RandomNickNames[7]="Harpy"
RandomNickNames[8]="Hydra"
RandomNickNames[9]="Iron"
RandomNickNames[10]="Manticore"
RandomNickNames[11]="Minotaur"
RandomNickNames[12]="Labyrinth"
RandomNickNames[13]="One More Try"
RandomNickNames[14]="Phoenix"
RandomNickNames[15]="Pied Piper"
RandomNickNames[16]="Redscreen"
RandomNickNames[17]="Rocket"
RandomNickNames[18]="Saber"
RandomNickNames[19]="Sphinx"
RandomNickNames[20]="Steel"
RandomNickNames[21]="The Accountant"
RandomNickNames[22]="Unicorn"
RandomNickNames_Male[0]="Orc"
RandomNickNames_Female[0]="Siren"

[ShadowOps_Hunter_LWOTC X2SoldierClassTemplate]
DisplayName="Hunter"
ClassSummary="The Hunter class is equally at home taking down enemies at long range with the sniper rifle or right up close with the sword. Our enemies will never know what hit them."
LeftAbilityTreeTitle="Marksman"
RightAbilityTreeTitle="Tracker"
+AbilityTreeTitles[0]="Marksman"
+AbilityTreeTitles[1]="Woodsman"
+AbilityTreeTitles[2]="Tracker"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNickNames[0]="Archer"
RandomNickNames[1]="Bear"
RandomNickNames[2]="Cheetah"
RandomNickNames[3]="Chimera"
RandomNickNames[4]="Coyote"
RandomNickNames[5]="Double Edge"
RandomNickNames[6]="Hyena"
RandomNickNames[7]="Jackrabbit"
RandomNickNames[8]="Icepick"
RandomNickNames[9]="Leopard"
RandomNickNames[10]="Lightning"
RandomNickNames[11]="Raptor"
RandomNickNames[12]="Raven"
RandomNickNames[13]="Sleepy"
RandomNickNames[14]="The Mountain"
RandomNickNames[15]="Tiger"
RandomNickNames[16]="Two Birds"
RandomNickNames[17]="Voodoo"
RandomNickNames[18]="Weasel"
RandomNickNames[19]="Wolf"
RandomNickNames[20]="Wolverine"
RandomNickNames[21]="Yeti"
RandomNickNames_Female[0]="Black Widow"
RandomNickNames_Female[1]="Dryad"
RandomNickNames_Female[2]="Lioness"
RandomNickNames_Male[0]="Cougar"
RandomNickNames_Male[1]="Green Man"
RandomNickNames_Male[2]="Lion"
RandomNickNames_Male[3]="Sandman"

[ShadowOps_Infantry_LWOTC X2SoldierClassTemplate]
DisplayName="Infantry"
ClassSummary="Our Infantry bring to bear sustained firepower at short and medium ranges. They're a key member of any squad."
LeftAbilityTreeTitle="Rifleman"
RightAbilityTreeTitle="Support"
+AbilityTreeTitles[0]="Rifleman"
+AbilityTreeTitles[1]="Dependable"
+AbilityTreeTitles[2]="Support"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNickNames[0]="Ace"
RandomNickNames[1]="Barrel"
RandomNickNames[2]="Brass"
RandomNickNames[3]="Broadside"
RandomNickNames[4]="Cyclops"
RandomNickNames[5]="Eagle"
RandomNickNames[6]="Falcon"
RandomNickNames[7]="Gorgon"
RandomNickNames[8]="Hailstorm"
RandomNickNames[9]="Hawk"
RandomNickNames[10]="Ice"
RandomNickNames[11]="Joker"
RandomNickNames[12]="Lead"
RandomNickNames[13]="Not Again"
RandomNickNames[14]="Royal Flush"
RandomNickNames[15]="Santa"
RandomNickNames[16]="Storm"
RandomNickNames[17]="Tracer"
RandomNickNames[18]="Trey"
RandomNickNames[19]="Two Hands"
RandomNickNames[20]="Vampire"
RandomNickNames[21]="Warlord"
RandomNickNames[22]="Zero"
RandomNickNames_Female[0]="Baroness"
RandomNickNames_Female[1]="Kitty"
RandomNickNames_Female[2]="Queen"
RandomNickNames_Male[0]="Baron"
RandomNickNames_Male[1]="King"
RandomNickNames_Male[2]="Snowman"

[ShadowOps_Scrapper_LWOTC X2SoldierClassTemplate]
DisplayName="Scrapper"
ClassSummary="Scrappers are intensively trained in unarmed and knife fighting in addition to firearms. In close quarters combat they're second to none."
LeftAbilityTreeTitle="Thug"
RightAbilityTreeTitle="Brawler"
+AbilityTreeTitles[0]="Thug"
+AbilityTreeTitles[1]="Lunatic"
+AbilityTreeTitles[2]="Brawler"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNicknames[0]="Bison"
RandomNicknames[1]="Broken Glass"
RandomNicknames[2]="Christmas"
RandomNicknames[3]="Claws"
RandomNicknames[4]="Cudgel"
RandomNicknames[5]="Dino"
RandomNicknames[6]="Dump Truck"
RandomNicknames[7]="Edge"
RandomNicknames[8]="Feet"
RandomNicknames[9]="Fruit"
RandomNicknames[10]="Jellybean"
RandomNicknames[11]="Junior"
RandomNicknames[12]="Knuckles"
RandomNicknames[13]="Little"
RandomNicknames[14]="Nosey"
RandomNicknames[15]="One Way"
RandomNicknames[16]="Ox"
RandomNicknames[17]="Peanut"
RandomNicknames[18]="Scar"
RandomNicknames[19]="Skin"
RandomNicknames[20]="Stiletto"
RandomNicknames[21]="Teeth"
RandomNicknames[22]="The Brute"
RandomNicknames[23]="Thirteen"
RandomNickNames_Male[0]="Mr. Mean"
RandomNickNames_Male[1]="Mutt"
RandomNickNames_Male[2]="Old Man"
RandomNickNames_Female[0]="Cat"
RandomNickNames_Female[1]="Mrs. Mean"
RandomNickNames_Female[3]="Old Woman"

[ShadowOps_Juggernaut_LWOTC X2SoldierClassTemplate]
DisplayName="Juggernaut"
ClassSummary="Just like the name suggests, Juggernauts carry our heaviest weapons and armor. What they lack in stealth they make up for in raw firepower."
LeftAbilityTreeTitle="Strike"
RightAbilityTreeTitle="Siege"
+AbilityTreeTitles[0]="Strike"
+AbilityTreeTitles[1]="Slayer"
+AbilityTreeTitles[2]="Siege"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNicknames[0]="Baseball"
RandomNicknames[1]="Beans"
RandomNicknames[2]="Brick"
RandomNicknames[3]="Burnout"
RandomNicknames[4]="Butterfly"
RandomNicknames[5]="Cape"
RandomNicknames[6]="Cardboard Box"
RandomNicknames[7]="Cube"
RandomNicknames[8]="Hailstorm"
RandomNicknames[9]="Heavy"
RandomNicknames[10]="Hero"
RandomNicknames[11]="Lemur"
RandomNicknames[12]="Little"
RandomNicknames[13]="Mammoth"
RandomNicknames[14]="Matchstick"
RandomNicknames[15]="Mountain"
RandomNicknames[16]="No Brakes"
RandomNicknames[17]="Petrol"
RandomNicknames[18]="Plutonium"
RandomNicknames[19]="Shell"
RandomNicknames[20]="Silly"
RandomNicknames[21]="Slab"
RandomNicknames[22]="Suspenders"
RandomNicknames[23]="Terror"
RandomNicknames[24]="Tower"
RandomNicknames[25]="Train"
RandomNickNames_Male[0]="Jack"
RandomNickNames_Female[0]="Jill"

[ShadowOps_Survivalist_LWOTC X2SoldierClassTemplate]
DisplayName="Survivalist"
ClassSummary="Survivalists are dedicated snipers who can quickly neutralize multiple targets. They also pack a sawed-off shotgun for close quarters engagements."
LeftAbilityTreeTitle="Sentry"
RightAbilityTreeTitle="Raider"
+AbilityTreeTitles[0]="Sentry"
+AbilityTreeTitles[1]="Survivor"
+AbilityTreeTitles[2]="Raider"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNicknames[0]="Aspen"
RandomNicknames[1]="Birch"
RandomNicknames[2]="Cedar"
RandomNicknames[3]="Chupacabra"
RandomNicknames[4]="Dark"
RandomNicknames[5]="Flint"
RandomNicknames[6]="Garbage"
RandomNicknames[7]="Kudzu"
RandomNicknames[8]="Long"
RandomNicknames[9]="Meat"
RandomNicknames[10]="Mossy"
RandomNicknames[11]="Muskrat"
RandomNicknames[12]="Pine"
RandomNicknames[13]="Pond"
RandomNicknames[14]="Powder"
RandomNicknames[15]="Ring"
RandomNicknames[16]="Robber"
RandomNicknames[17]="Sandwich"
RandomNicknames[18]="Sasquach"
RandomNicknames[19]="Slate"
RandomNicknames[20]="Snare"
RandomNicknames[21]="Steak"
RandomNicknames[22]="Stinky"
RandomNicknames[23]="Tanner"
RandomNicknames[24]="Tire"
RandomNicknames[25]="Walker"
RandomNicknames[26]="Werewolf"
RandomNicknames[27]="Whiskey"
RandomNicknames[28]="Yeti"
RandomNickNames_Male[0]="Buffalo Bill"
RandomNickNames_Male[1]="Dusk"
RandomNickNames_Female[0]="Dawn"
RandomNickNames_Female[1]="Pearl"

[ShadowOps_Recon_LWOTC X2SoldierClassTemplate]
DisplayName="Recon"
ClassSummary="The Recon is our primary scouting class, trained to remain concealed and assist other squad members using the holotargeter. Their high mobility also makes them well suited for flanking maneuvers."
LeftAbilityTreeTitle="Vanguard"
RightAbilityTreeTitle="Spotter"
+AbilityTreeTitles[0]="Vanguard"
+AbilityTreeTitles[1]="Enigma"
+AbilityTreeTitles[2]="Spotter"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
RandomNicknames[0]="Balcony"
RandomNicknames[1]="Bishop"
RandomNicknames[2]="Breakneck"
RandomNicknames[3]="Cola"
RandomNicknames[4]="Glass"
RandomNicknames[5]="Jammer"
RandomNicknames[6]="Magic"
RandomNicknames[7]="Marbles"
RandomNicknames[8]="Master"
RandomNicknames[9]="One"
RandomNicknames[10]="Radar"
RandomNicknames[11]="Rogue"
RandomNicknames[12]="Sad"
RandomNicknames[13]="Sewer"
RandomNicknames[14]="Shuffle"
RandomNicknames[15]="Silver"
RandomNicknames[16]="Slick"
RandomNicknames[17]="Sonic"
RandomNicknames[18]="Stairs"
RandomNicknames[19]="Straw"
RandomNicknames[20]="Toucan"
RandomNicknames[21]="Upstairs"
RandomNicknames[22]="Wasp"
RandomNicknames[23]="Whisper"
RandomNickNames_Male[0]="Batman"
RandomNickNames_Male[1]="Mad Hatter"
RandomNickNames_Female[0]="Alice"
RandomNickNames_Female[1]="Catwoman"

[ShadowOps_Fortify X2AbilityTemplate]
LocFriendlyName="Stop At Nothing"
LocLongDescription="Whenever you enter overwatch or use suppression, you gain <Ability:+Defense:ShadowOps_FortifyTrigger/> Defense until the start of your next turn."
LocHelpText="Whenever you enter overwatch or use suppression, you gain <Ability:+Defense:ShadowOps_FortifyTrigger/> Defense until the start of your next turn."
LocFlyOverText="Stop At Nothing"
LocPromotionPopupText="<Bullet/> Stop At Nothing will work with any activated ability that gives you reaction shots, including Fend Off. <br/>"

[ShadowOps_ZoneOfControl_LW2 X2AbilityTemplate]
LocFriendlyName="Fend Off"
LocLongDescription="Enter a special overwatch which grants up to <Ability:ZoneOfControlLW2Shots/> reaction shots and the Covering Fire ability. <Ability:SelfCooldown/> turn cooldown."
LocHelpText="Enhanced overwatch that can fire multiple times in a turn."
LocFlyOverText="Fend Off"
LocPromotionPopupText="<Bullet/> Fend Off has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[ShadowOps_Hipfire_LW2 X2AbilityTemplate]
LocFriendlyName="Whippit"
LocLongDescription="The first time you fire your Sawed-Off Shotgun each turn doesn't cost an action."
LocHelpText="The first time you fire your Sawed-Off Shotgun each turn doesn't cost an action."
LocFlyOverText="Whippit"
LocPromotionPopupText="<Bullet/> You can't fire the Sawed-Off Shotgun when out of actions.<br/>"

[ShadowOps_Focus X2AbilityTemplate]
LocFriendlyName="Focus"
LocLongDescription="Your first reaction shot each turn is guaranteed to hit."
LocHelpText="Your first reaction shot each turn is guaranteed to hit."
LocFlyOverText="Focus"
LocPromotionPopupText="<Bullet/> This applies to any reaction shot, e.g. Overwatch, Suppression, or That's Close Enough.<br/><Bullet/> Although the first reaction shot each turn will never miss, it can still graze.<br/>"

[IsmsShadowborn X2AbilityTemplate]
LocFriendlyName="Shadowborn"
LocLongDescription="The <Ability:ClassName/> is much more difficult to detect while concealed. Also, small bonuses to Aim and Crit Chance while in concealment."
LocHelpText="-33% detection radius while concealed. +15% aim and crit with all shots from concealment."
LocFlyOverText="Shadowborn" 
LocPromotionPopupText="<Bullet/> -33% detection radius. <br/><Bullet/> +15% Crit Chance and Aim from stealth."

[LWS_Agent X2SoldierClassTemplate]
DisplayName="<font color='#DDEBEE'>Agent</font>"
ClassSummary="The Agent is a flexible soldier that can fight up close with a shotgun and their knife, or take a more subtle approach as a stealthy sniper. What makes them stand out the most, though, is their speed and talent for stealing enemy assets."

LeftAbilityTreeTitle="Heist"
RightAbilityTreeTitle="Dagger"
AbilityTreeTitles[0]="Heist"
AbilityTreeTitles[1]="Cloak"
AbilityTreeTitles[2]="Dagger"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

;ALPHABETICAL ORDER... NOT!
RandomNickNames[0]="Double-Oh"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Stab"
RandomNickNames[3]="Butcher"
RandomNickNames[4]="Sinew"
RandomNickNames[5]="Rogue"
RandomNickNames[6]="Ghost"
RandomNickNames[7]="Shroud"
RandomNickNames[8]="Shank"
RandomNickNames[9]="Edge"
RandomNickNames[10]="Cutter"
RandomNickNames[11]="Licensed"
RandomNickNames[12]="Enforcer"
RandomNickNames[13]="Fatal"
RandomNickNames[14]="Flash"
RandomNickNames[15]="Jury"
RandomNickNames[16]="Judge"
RandomNickNames[17]="Stranger"
RandomNickNames[18]="One-Two"
RandomNickNames[19]="Greyhound"
RandomNickNames[20]="No Trace"
RandomNickNames[21]="Fang"
RandomNickNames[22]="Bloodletter"
RandomNickNames[23]="Casanova"
RandomNickNames[24]="Big One"
RandomNickNames[25]="Blast"
RandomNickNames[26]="Mustang"
RandomNickNames[27]="Paladin"
RandomNickNames[28]="Pitbull"
RandomNickNames[29]="Predator"
RandomNickNames[30]="Razor"
RandomNickNames[31]="Samurai"
RandomNickNames[32]="Scorpion"
RandomNickNames[33]="Shogun"
RandomNickNames[34]="Shadow"
RandomNickNames[35]="Slayer"
RandomNickNames[36]="Snake"
RandomNickNames[37]="Snake Eyes"
RandomNickNames[38]="Solo"
RandomNickNames[39]="Specter"
RandomNickNames[40]="Spider"
RandomNickNames[41]="Stalker"
RandomNickNames[42]="Steel"
RandomNickNames[43]="Stinger"
RandomNickNames[44]="Last Gasp"
RandomNickNames[45]="Trojan"
RandomNickNames[46]="Tinker"
RandomNickNames[47]="Neo"
RandomNickNames[48]="Warden"
RandomNickNames[49]="Warlord"
RandomNickNames[50]="Wolverine"
;ALPHABETICAL ORDER... lol
RandomNickNames_Male[0]="Womanizer"
RandomNickNames_Male[1]="Gentleman"
RandomNickNames_Male[2]="Guy"
RandomNickNames_Male[3]="Stallion"
RandomNickNames_Male[4]="Q"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Black Widow"
RandomNicknames_Female[4]="Executor"
RandomNickNames_Female[5]="Valkyrie"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His blade...THEIR BLOOD!"
PhotoboothSoloBLines_Male[1]="The last thing you never see."
PhotoboothSoloBLines_Male[2]="His blade will bring JUSTICE!"
PhotoboothSoloBLines_Male[3]="Close, personal, and DEADLY!"
PhotoboothSoloBLines_Male[4]="Blademaster. Death dealer."
PhotoboothSoloBLines_Female[0]="Her blade...THEIR BLOOD!"
PhotoboothSoloBLines_Female[1]="The last thing you never see."
PhotoboothSoloBLines_Female[2]="Her blade will bring JUSTICE!"
PhotoboothSoloBLines_Female[3]="Close, personal, and DEADLY!"

[LWS_Crasher X2SoldierClassTemplate]
DisplayName="<font color='#67A6B3'>Crasher</font>"
ClassSummary="The Crasher specializes in taking on multiple opponents at close range. They're equally adept at rushing an enemy position or being the rearguard as the squad moves to evac."

LeftAbilityTreeTitle="Shell Shock"
RightAbilityTreeTitle="Escape Artist"
AbilityTreeTitles[0]="Shell Shock"
AbilityTreeTitles[1]="Cut Down"
AbilityTreeTitles[2]="Escape Artist"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Arbiter"
+RandomNickNames[1]="Bear"
+RandomNickNames[2]="Bishop"
+RandomNickNames[3]="Bloodhound"
+RandomNickNames[4]="Bulwark"
+RandomNickNames[5]="Delta"
+RandomNickNames[6]="Flash"
+RandomNickNames[7]="Goliath"
+RandomNickNames[8]="Grease"
+RandomNickNames[9]="Hardass"
+RandomNickNames[10]="Hardball"
+RandomNickNames[11]="Holdout"
+RandomNickNames[12]="Judge"
+RandomNickNames[13]="Knight"
+RandomNickNames[14]="Marshal"
+RandomNickNames[15]="Ranger"
+RandomNickNames[16]="Rhino"
+RandomNickNames[17]="Rook"
+RandomNickNames[18]="Smoke"
+RandomNickNames[19]="Shepherd"
+RandomNickNames[20]="Shield"
+RandomNickNames[21]="Tango"
+RandomNickNames[22]="Templar"
+RandomNickNames[23]="Titan"
+RandomNickNames[24]="Warden"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Bulldog"
+RandomNickNames_Male[1]="Chicago"
+RandomNickNames_Male[2]="Eagle"
+RandomNickNames_Male[3]="Falcon"
+RandomNickNames_Male[4]="Hawk"
+RandomNickNames_Male[5]="Gryphon"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Amber"
+RandomNickNames_Female[1]="Bell"
+RandomNickNames_Female[2]="Crystal"
+RandomNickNames_Female[3]="Dagger"
+RandomNickNames_Female[4]="Rogue"
+RandomNickNames_Female[5]="Ruby"
+RandomNickNames_Female[6]="Sapphire"
+RandomNickNames_Female[7]="Scarlet"
+RandomNickNames_Female[8]="Widow"

;This class is only intended for Jane Kelly, so there's only one callsign by default. Feel free to change this.
RandomNickNames[0]="Reclaimer"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His blade...THEIR BLOOD!"
PhotoboothSoloBLines_Male[1]="The last thing you never see."
PhotoboothSoloBLines_Male[2]="His blade will bring JUSTICE!"
PhotoboothSoloBLines_Male[3]="Close, personal, and DEADLY!"
PhotoboothSoloBLines_Male[4]="Blademaster. Death dealer."
PhotoboothSoloBLines_Female[0]="Her blade...THEIR BLOOD!"
PhotoboothSoloBLines_Female[1]="The last thing you never see."
PhotoboothSoloBLines_Female[2]="Her blade will bring JUSTICE!"
PhotoboothSoloBLines_Female[3]="Close, personal, and DEADLY!"
PhotoboothSoloBLines_Female[4]="Blademaster. Death dealer."

[Stormtrooper X2SoldierClassTemplate]
DisplayName="<font color='#А96241'>Stormtrooper</font>"
ClassSummary="Charging ever forward, the Stormtrooper relies on their mobility, carrying only a bullpup rifle and a set of grenades. Highly agressive, the Stormtrooper can clear a room easily."

; These entries are used with the "classic" promotion screen that shows just the two ability columns.

LeftAbilityTreeTitle="Clearer"
RightAbilityTreeTitle="Breacher"

; These entries are used for the "new" promotion screen in the Training Center or with the New Promotion Screen By Default mod.

AbilityTreeTitles[0]="Breacher"
AbilityTreeTitles[1]="Runner"
AbilityTreeTitles[2]="Clearer"
AbilityTreeTitles[3]="Xcom"
AbilityTreeTitles[4]="Пистолет"

;ALPHABETICAL ORDER
RandomNickNames[0]="Arbiter"
RandomNickNames[1]="Berserker"
RandomNickNames[2]="Breaker"
RandomNickNames[3]="Bulldog"
RandomNickNames[4]="Cathar"
RandomNickNames[5]="Chance"
RandomNickNames[6]="Charger"
RandomNickNames[7]="Cruiser"
RandomNickNames[8]="Daredevil"
RandomNicknames[9]="Devil Dog"
RandomNickNames[10]="Errant"
RandomNickNames[11]="Final"
RandomNicknames[12]="Fulminatior"
RandomNicknames[13]="Hero"
RandomNickNames[14]="Immortal"
RandomNickNames[15]="Judge"
RandomNickNames[16]="Justicar"
RandomNickNames[17]="Knightmare"
RandomNickNames[18]="Lancer"
RandomNickNames[19]="Motor"
RandomNickNames[20]="Northbound"
RandomNicknames[21]="Overlord"
RandomNicknames[22]="Penetrator"
RandomNickNames[23]="Point Break"
RandomNicknames[24]="Questor"
RandomNickNames[25]="Quickstep"
RandomNicknames[26]="Rider"
RandomNicknames[27]="Stormfront"
RandomNickNames[28]="Templar"
RandomNickNames[29]="Vindicator"
RandomNickNames[30]="Warlord"
RandomNicknames[31]="Zero"
PhotoboothSoloBLines_Female[4]="Blademaster. Death dealer."

[LWS_Heavy X2SoldierClassTemplate]
DisplayName="Heavy"
ClassSummary="The Heavy is a front line specialist that excels in attrition fights with sustained cannon fire. If time is of the essence, you can count on their rocket launcher to turn the tide quickly."
LeftAbilityTreeTitle="No Retreat"
RightAbilityTreeTitle="Munitions"
AbilityTreeTitles[0]="No Retreat"
AbilityTreeTitles[1]="Loose Cannon"
AbilityTreeTitles[2]="Munitions"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"
;ALPHABETICAL ORDER
RandomNickNames[0]="All Day"
RandomNickNames[1]="All In"
RandomNickNames[2]="Animal"
RandomNickNames[3]="Baller"
RandomNickNames[4]="Big Country"
RandomNickNames[5]="Big Money"
RandomNickNames[6]="Big Nasty"
RandomNickNames[7]="Blaze"
RandomNickNames[8]="Boom Boom"
RandomNickNames[9]="Boomer"
RandomNickNames[10]="Bomber"
RandomNickNames[11]="Bulldog"
RandomNickNames[12]="Bull Rush"
RandomNickNames[13]="Claymore"
RandomNickNames[14]="Demo"
RandomNickNames[15]="Defcon"
RandomNickNames[16]="Devil Dog"
RandomNickNames[17]="Diesel"
RandomNickNames[18]="Encore"
RandomNickNames[19]="Fireball"
RandomNickNames[20]="Fridge"
RandomNickNames[21]="Gunner"
RandomNickNames[22]="Hammer"
RandomNickNames[23]="Hellfire"
RandomNickNames[24]="Hightower"
RandomNickNames[25]="Hoss"
RandomNickNames[26]="Volcano"
RandomNickNames[27]="Hurricane"
RandomNickNames[28]="Junkyard"
RandomNickNames[29]="Juggernaut"
RandomNickNames[30]="Knockout"
RandomNickNames[31]="Kong"
RandomNickNames[32]="Mad Dog"
RandomNickNames[33]="Meltdown"
RandomNickNames[34]="Moose"
RandomNickNames[35]="Nova"
RandomNickNames[36]="Nitro"
RandomNickNames[37]="Nukes"
RandomNickNames[38]="Ogre"
RandomNickNames[39]="Pitbull"
RandomNickNames[40]="Pyro"
RandomNickNames[41]="Redline"
RandomNickNames[42]="Rhino"
RandomNickNames[43]="Rocket"
RandomNickNames[44]="Seabreeze"
RandomNickNames[45]="Slab"
RandomNickNames[46]="Smash"
RandomNickNames[47]="Spitfire"
RandomNickNames[48]="Smokey"
RandomNickNames[49]="Swamp Thing"
RandomNickNames[50]="T-Bone"
RandomNickNames[51]="T-Rex"
RandomNickNames[52]="Tank"
RandomNickNames[53]="Thumper"
RandomNickNames[54]="Thunder"
RandomNickNames[55]="Tickle"
RandomNickNames[56]="Tiny"
RandomNickNames[57]="Titan"
RandomNickNames[58]="Dynamite"
RandomNickNames[59]="Torch"
RandomNickNames[60]="Wardog"
RandomNickNames[61]="Warhorse"
RandomNickNames[62]="Wildchild"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Axeman"
RandomNickNames_Male[1]="Duke"
RandomNickNames_Male[2]="Rocky"
RandomNickNames_Male[3]="Stallion"
RandomNickNames_Male[4]="Wolfman"
;;;;;;MOI;;;;;;
RandomNickNames_Male[5]="Mouton"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Bringing the boom!"
PhotoboothSoloBLines_Male[1]="The forecast calls for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Male[2]="No Cover. No Mercy."
PhotoboothSoloBLines_Male[3]="Artillery. Danger close."
PhotoboothSoloBLines_Male[4]="Tick, tick, BOOM!"
PhotoboothSoloBLines_Male[5]="Bombs away!"
PhotoboothSoloBLines_Male[6]="Bullets: the more the merrier!"
PhotoboothSoloBLines_Male[7]="Call him the weatherman, because he'll make it rain."
PhotoboothSoloBLines_Male[8]="Once more into the breach!"
PhotoboothSoloBLines_Male[9]="Stealth is overrated."

PhotoboothSoloBLines_Female[0]="Bringing the boom!"
PhotoboothSoloBLines_Female[1]="The forecast calls for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Female[2]="No Cover. No Mercy."
PhotoboothSoloBLines_Female[3]="Artillery. Danger close."
PhotoboothSoloBLines_Female[4]="Tick, tick, BOOM!"
PhotoboothSoloBLines_Female[5]="Bombs away!"
PhotoboothSoloBLines_Female[6]="Bullets: the more the merrier!"
PhotoboothSoloBLines_Female[7]="Call her the weatherman, because she'll make it rain."
PhotoboothSoloBLines_Female[8]="Once more into the breach!"
PhotoboothSoloBLines_Female[9]="Stealth is overrated."

[LWRocketLauncher X2AbilityTemplate]
LocLongDescription = "Fire a rocket at a target area. Damages enemies, shreds armor, and destroys terrain."
LocFriendlyName = "Rocket Launcher"
LocHelpText = "Fire a rocket at target area. <Ability:ROCKETSCATTER/>"
